notas/Aprendizaje/notas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-13 Tue 14:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Reconocimiento de Patrones y Aprendizaje Automatizado</title>
<meta name="author" content="Erik Rangel Limón" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Reconocimiento de Patrones y Aprendizaje Automatizado</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org45622f5">Rubros</a></li>
<li><a href="#org2035a2b">Notas</a>
<ul>
<li><a href="#org5d96b88">14 / 08 / 23</a>
<ul>
<li><a href="#org58b6ec0">Temario</a></li>
</ul>
</li>
<li><a href="#orgce68ce6">16 / 08 / 23</a>
<ul>
<li><a href="#org0bab996">Breve historia de la Inteligencia Artificial</a></li>
<li><a href="#org7576b63">NLP</a></li>
<li><a href="#org1b0fea3">¿Por qué es importante?</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org768bb99">Bibliografía</a></li>
</ul>
</div>
</div>

<div id="outline-container-org45622f5" class="outline-2">
<h2 id="org45622f5">Rubros</h2>
<div class="outline-text-2" id="text-org45622f5">
<ul class="org-ul">
<li>Proyecto final 40%</li>
<li>Tareas y laboratorio 60%</li>
</ul>
</div>
</div>

<div id="outline-container-org2035a2b" class="outline-2">
<h2 id="org2035a2b">Notas</h2>
<div class="outline-text-2" id="text-org2035a2b">
</div>
<div id="outline-container-org5d96b88" class="outline-3">
<h3 id="org5d96b88">14 / 08 / 23</h3>
<div class="outline-text-3" id="text-org5d96b88">
</div>
<div id="outline-container-org58b6ec0" class="outline-4">
<h4 id="org58b6ec0">Temario</h4>
<div class="outline-text-4" id="text-org58b6ec0">
<ol class="org-ol">
<li>Introducción y bases matemáticas ¿Qué es el reconocimiento de
patrones? Paradigma probabilístico</li>

<li>Paradigma y práctica común del aprendizaje
automatizado. Regresiones lineal y estadística. Métricas de
evaluación. kNN. Paradigma bayesiano.</li>

<li>Algoritmos no supervisados y agrupamientos
k-Means. EM. Hierarchical. Métricas de pureza de
grupos. Reducción de dimensión: PCA / SVD. ICA.</li>

<li>Boosting, algoritmos de ensamble y árboles de decisión
(tentativo).</li>

<li>Paradigma neuronal: Funciones de
activación. Retropropagación. MLP y RBN. ConvNets.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orgce68ce6" class="outline-3">
<h3 id="orgce68ce6">16 / 08 / 23</h3>
<div class="outline-text-3" id="text-orgce68ce6">
</div>
<div id="outline-container-org0bab996" class="outline-4">
<h4 id="org0bab996">Breve historia de la Inteligencia Artificial</h4>
<div class="outline-text-4" id="text-org0bab996">
<ul class="org-ul">
<li>1931 - Gödel: Decidibilidad de las matemáticas</li>

<li>1936 - Alan Turing: <i>Universal Turin Machine</i></li>

<li>1943 - McCullog &amp; Pitts: "<i>A logical Calculus of the Ideas
Immanent in Nervous Activity</i>"</li>

<li>1943 - Rosenblueth, Wiener &amp; Rigelow: acuñan el término de
cibernética</li>

<li>1943 - Post: Reglas de producción como sistema computacional</li>

<li>1945 - Polya: Acuña el término "<i>heurística</i>"</li>

<li>1950 - Turing: "<i>Computing Machinery and Intelligence</i>"</li>

<li>1950 - Claude Shannon: "<i>Programming a computer to play chess</i>"</li>

<li>1950 - McCarthy propone el témrino "inteligencia artificial"</li>

<li>1957 - Newell, Shaw &amp; Simon: The Geeral Problem Solver.</li>

<li>1958 - McCarthy: propone usar el cálculo de predicados como
lenguaje para representar y usal el conocimiento: LISP.</li>

<li>1950 - Slagle: Programa para damas chinas.</li>

<li>1961 - Unimation: Primer empresa que fabrica un robot en el
munod (Unimate)</li>

<li>1961 / 1964 - Slagle: Integración simbólica (Lisp), Evans:
ANALOGY</li>

<li>1963 - Lorenz: <i>Deterministic Non periodic flow</i></li>

<li>1965 - Chomsky: Lingüística, Weizenbaum: ELIZA.</li>

<li>1968 - Minsky &amp; Papert: Limtaciones del perceptrón.</li>

<li>(Invierno neuronal)</li>

<li>2021 - Desarrolo de aprendizaje estadístico, matemáticas y redes
neuronales para procesamiento de imágenes y procesamiento del
lenguaje natural.</li>
</ul>
</div>
</div>

<div id="outline-container-org7576b63" class="outline-4">
<h4 id="org7576b63">NLP</h4>
<div class="outline-text-4" id="text-org7576b63">
<p>
Completar un crucigrama de 2 x 2, de forma correcta puede
significar encontrar la combinación correcta que puede tener.
</p>

<p>
\(27^4\) operaciones
</p>

<p>
De las cuales no todas serán posibles. Pero todo el punto es
satisface mediante una búsqueda la combincaión correcta. 
</p>
</div>
</div>

<div id="outline-container-org1b0fea3" class="outline-4">
<h4 id="org1b0fea3">¿Por qué es importante?</h4>
<div class="outline-text-4" id="text-org1b0fea3">
<p>
Nuestro problema se transformó en la necesidad de construir un
algoritmo que reconozca patrones.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org768bb99" class="outline-2">
<h2 id="org768bb99">Bibliografía</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Erik Rangel Limón</p>
<p class="date">Created: 2024-08-13 Tue 14:59</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
